app/controllers/pokemons_controller.rb

	def capture
		@pokemon = Pokemon.find(params[:id])
		@pokemon.update_attribute(:trainer_id, current_trainer.id)
---
SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "pokemons" SET "trainer_id" = ?, "updated_at" = ? WHERE "pokemons"."id" = ?  [["trainer_id", 1], ["updated_at", "2016-03-16 13:16:42.132273"], ["id", 1]]

	def damage
		@pokemon = Pokemon.find(params[:id])
		@pokemon.health -= 10
    if @pokemon.health <= 0
      @pokemon.delete
    else
		  @pokemon.save
---
SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "pokemons" WHERE "pokemons"."id" = ?  [["id", 7]]
UPDATE "pokemons" SET "health" = ?, "updated_at" = ? WHERE "pokemons"."id" = ?  [["health", 90], ["updated_at", "2016-03-18 10:04:46.470836"], ["id", 1]]