app/views/trainers/show.html.erb

SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."trainer_id" = ?  [["trainer_id", 5]]
---
<ul>Pokemon List
  <% @trainer.pokemons.each do |pokemon| %>